# my_list2 = [random.randint(5, 25) for _ in range(5)]
# my_list = random.sample(range(-5, 55), random.randint(5, 10))

# `my_list2` создает список случайных целых чисел от 5 до 25 (включительно) длиной 5 элементов.
#
# `my_list` создает случайную выборку из диапазона чисел от -5 до 55 (включительно) длиной,
# которая определяется случайно от 5 до 10 элементов.
#
# Таким образом, `my_list2` генерирует фиксированное количество случайных чисел в указанном диапазоне,
# в то время как `my_list` генерирует случайное количество случайных чисел в указанном диапазоне.