# Напишите функцию, которая принимает на вход список слов и возвращает словарь,
# в котором ключами являются слова, а значениями - количество гласных букв в каждом слове.
#some_text = ["This is a simple sentence.", "Another sentence with words.", "And a simple sentence again."]
#text = ['sentence', 'simple', 'with', 'sentence']
# def dict_word(some_list: list):
#     dict_out = {}
#     for element in some_list:
#         count_letter = 0
# #     for letter in element:
#             if letter.lower() in 'aeouiy':
#                 count_letter += 1
#         dict_out[element] = count_letter
#     return dict_out
# resalt = dict_word(some_text)
# print(resalt)
# def dict_word(some_list: list):
#     dict_out = {element: sum(1 for letter in element.lower() if letter in 'aeouiy') for element in some_list}
#     return dict_out
# resalt = dict_word(text)
# print(resalt)# жесть какая

# Создайте словарь, в котором ключами являются буквы из слова "Programming", а значениями - их порядковые номера.
#text = "Programming"
# def create_dict(some_text: str):
#     dict_out = {}
#     for index, letter in enumerate( some_text):
#         dict_out[letter] = index
#     return dict_out
# resalt = create_dict(text)
# print(resalt)

# def create_dict(some_text: str):
#     dict_out = {letter: index for index, letter in enumerate(some_text)}
#     return dict_out
# resalt = create_dict(text)
# print(resalt)

# Создайте словарь, где ключами являются буквы из слова "Android", а значениями - их ASCII-коды.
# text = "Android"
# def key_text_value_code(some_text: str):
#     dict_out = {letter: ord(letter) for letter in some_text}
#     return dict_out
# resalt = key_text_value_code(text)
# print(resalt)

# Напишите функцию, которая принимает на вход список слов и возвращает словарь,
# в котором ключами являются слова, а значениями - количество согласных букв в каждом слове.
#some_words = ['we', 'can', 'book', 'read', 'only']
# def dict_key_words_value_count_letters(words_list: list):
#     dict_out = {}
#
#     for words in words_list:
#         count = 0
#         for letter in words:
#             if letter not in 'aouiye':
#                 count += 1
#         dict_out[words] = count
#     return dict_out
# resalt = dict_key_words_value_count_letters(some_words)
# print(resalt)

# def dict_key_words_value_count_letters(words_list: list):
#     dict_out = {words: sum(1 for letter in words if letter.lower() not in 'aouiye' ) for  words in some_words}
#     return dict_out
# resalt = dict_key_words_value_count_letters(some_words)
# print(resalt)

# Создайте словарь, в котором ключами являются буквы из слова "ChatGPT", а значениями - их порядковые номера.
# some_text = "ChatGPT"
# dict_out = {letter: index for index, letter in enumerate(some_text)}
# print(dict_out)

# Напишите функцию, которая принимает на вход список чисел и возвращает словарь,
# в котором ключами являются числа, а значениями - их степени 2^x.
# some_numbers = [5, 2, 1, 0, 4]
# dict_out = {number: 2 ** number for number in some_numbers}
# print(dict_out)

# Напишите функцию, которая принимает на вход список слов и возвращает словарь,
# в котором ключами являются слова, а значениями - их обратное представление (слова задом наперед).
# some_words = ['we', 'can', 'book', 'read', 'only']
# dict_out = {word: word[::-1] for word in some_words }
# print(dict_out)

# Создайте словарь, где ключами являются числа от 1 до 6, а значениями - список их бинарных представлений.
# some_numbers = list(range(1, 7))
# dict_out = {number: bin(number) for number in some_numbers}
# print(dict_out)

#import math
# Напишите функцию, которая принимает на вход список чисел и возвращает словарь,
# в котором ключами являются числа, а значениями - их факториалы.
#some_numbers = list(range(1, 7))
# dict_out = {number: math.factorial(number) for number in range(1, 7)}
# print(dict_out)

# Создайте словарь, в котором ключами являются буквы из слова "OpenAI", а значениями - их порядковые номера.
# text = "OpenAI"
# dict_out = {letter: index for index, letter in enumerate(text)}
# print(dict_out)

# Напишите функцию, которая принимает на вход список чисел и возвращает словарь,
# в котором ключами являются числа, а значениями - их факториалы
# import math
# dict_out = {number: math.factorial(number) for number in range(1, 10)}
# print(dict_out)

# Создайте словарь, в котором ключами являются числа от 1 до 10, а значениями - список их кубов.
# dict_out = {number: number ** 3 for number in range(1, 11)}
# print(dict_out)

# Напишите функцию, которая принимает на вход список слов и возвращает словарь,
# в котором ключами являются слова, а значениями - их обратное представление (слова задом наперед).
# some_text = ['we learn', 'yes i can', 'lets solve the task']
# dict_out = {words: words[::-1] for words in some_text}
# print(dict_out)
